<?php

return [
    'login_page' => [
        'title' => 'مرحبًا بعودتك!',
        'subtitle' => 'يرجى تسجيل الدخول إلى حسابك',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'remember_me' => 'تذكرني',
        'forgot_password' => 'هل نسيت كلمة المرور؟',
        'login' => 'تسجيل الدخول',
        'login_failed' => 'فشل تسجيل الدخول. يرجى التحقق من بريدك الإلكتروني وكلمة المرور',
    ],
    'forgot_page' => [
        'title' => 'نسيت كلمة المرور',
        'subtitle' => 'يرجى إدخال عنوان بريدك الإلكتروني لإعادة تعيين كلمة المرور',
        'email' => 'البريد الإلكتروني',
        'login' => 'تسجيل الدخول',
        'send_reset_link' => 'إرسال رابط إعادة التعيين',
    ],
    'reset_password_page' => [
        'title' => 'إعادة تعيين كلمة المرور',
        'subtitle' => 'يرجى إدخال كلمة المرور الجديدة',
        'new_password' => 'كلمة المرور الجديدة',
        'change_password' => 'تغيير كلمة المرور',
        'type_same_password' => 'يرجى كتابة نفس كلمة المرور مرة أخرى',
        'confirm_new_password' => 'تأكيد كلمة المرور الجديدة',
        'password_must_at_least' => 'يجب أن تكون كلمة المرور مكونة من 6 أحرف على الأقل',
        'token_reset_invalid' => 'يبدو أن الرابط الذي قدمته قد انتهت صلاحيته. لتسجيل الدخول مرة أخرى يرجى النقر <a href=":url">هنا</a>',
    ],
];